In [1]:
import pandas as pd
import numpy as np

In [2]:
 df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                       'BBB': [10, 20, 30, 40],
                       'CCC': [100, 50, -30, -50]})

In [44]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [45]:
df.loc[df.AAA >=5,'BBB'] = -1

In [46]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [47]:
df.loc[df.AAA >= 5,['BBB','CCC']] = 555

In [48]:
df

   AAA  BBB  CCC
0    4   10  100
1    5  555  555
2    6  555  555
3    7  555  555

In [49]:
df.loc[df.AAA < 5,['BBB','CCC']] = 2000

In [50]:
df

   AAA   BBB   CCC
0    4  2000  2000
1    5   555   555
2    6   555   555
3    7   555   555

In [51]:
df_mask = pd.DataFrame({'AAA': [True] * 4,
                            'BBB': [False] * 4,
                            'CCC': [True, False] * 2})

In [52]:
df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [53]:
df.where(df_mask,-1000)

   AAA   BBB   CCC
0    4 -1000  2000
1    5 -1000 -1000
2    6 -1000   555
3    7 -1000 -1000

In [54]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                       'BBB': [10, 20, 30, 40],
                       'CCC': [100, 50, -30, -50]})

In [55]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [56]:
df['logic'] = np.where(df['AAA'] > 5,'HIGH','LOW')

In [57]:
df

   AAA  BBB  CCC logic
0    4   10  100   LOW
1    5   20   50   LOW
2    6   30  -30  HIGH
3    7   40  -50  HIGH

In [60]:
df

   AAA  BBB  CCC logic  vals
0    4    4    4   LOW     4
1    5   20   50   LOW     4
2    6   30  -30  HIGH     4
3    7   40  -50  HIGH     4

In [61]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
   ....:                    'BBB': [10, 20, 30, 40],
   ....:                    'CCC': [100, 50, -30, -50]})
   ....:

In [62]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [63]:
df[df.AAA <= 5]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [64]:
df[df.AAA > 5]

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

In [65]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
   ....:                    'BBB': [10, 20, 30, 40],
   ....:                    'CCC': [100, 50, -30, -50]})
   ....:

In [66]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [67]:
df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40),'AAA']

0    4
1    5
Name: AAA, dtype: int64

In [68]:
df.loc[(df['BBB'] > 25) | (df['CCC'] >= -40),'AAA']

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

In [69]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [70]:
df.loc[(df['BBB'] > 25) | (df['CCC'] >=75),'AAA'] = 0.1

In [71]:
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   20   50
2  0.1   30  -30
3  0.1   40  -50

In [72]:
aValue = 43

In [78]:
df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1  5.0   20   50
0  0.1   10  100
2  0.1   30  -30
3  0.1   40  -50

In [79]:
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   20   50
2  0.1   30  -30
3  0.1   40  -50

In [80]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
   ....:                    'BBB': [10, 20, 30, 40],
   ....:                    'CCC': [100, 50, -30, -50]})
   ....:

In [4]:
Crit1 = df.AAA<=5.5
Crit2 = df.BBB == 10
Crit3 = df.CCC > -40

In [5]:
AllCrit = Crit1 & Crit2 & Crit3

In [7]:
import functools
CritList = [Crit1,Crit2,Crit3]
AllCrit = functools.reduce(lambda x,y:x&y,CritList)

In [9]:
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

In [10]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [13]:
df[~((df.AAA <=6) & (df.index.isin([0,2,4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [14]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [15]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [31]:
df = pd.DataFrame({'AAA': [1, 2, 1, 3],
   ....:                    'BBB': [1, 1, 2, 2],
   ....:                    'CCC': [2, 1, 3, 1]})
   ....:

In [17]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [25]:
source_cols = df.columns
new_cols = [str(x)+'_cat' for x in source_cols]
categories = {1:'Alpha',2:'Beta',3:'Gamma'}
df[new_cols] = df[source_cols].applymap(categories.get)

TypeError: 'builtin_function_or_method' object is not iterable

In [30]:
df

   AAA  BBB  CCC AAA_cat BBB_cat CCC_cat
0    1    1    2   Alpha   Alpha    Beta
1    2    1    1    Beta   Alpha   Alpha
2    1    2    3   Alpha    Beta   Gamma
3    3    2    1   Gamma    Beta   Alpha

In [33]:
source_cols = df.columns
new_cols = [str(x)+"_cat" for x in source_cols]
categories = {1:'alpha',2:'beta',3:'gamma'}
df[new_cols] = df[source_cols].applymap(categories.get)

In [34]:
df

   AAA  BBB  CCC AAA_cat BBB_cat CCC_cat
0    1    1    2   alpha   alpha    beta
1    2    1    1    beta   alpha   alpha
2    1    2    3   alpha    beta   gamma
3    3    2    1   gamma    beta   alpha

In [35]:
df = pd.DataFrame({'AAA': [1, 1, 1, 2, 2, 2, 3, 3],
   ....:                    'BBB': [2, 1, 3, 4, 5, 1, 2, 3]})
   ....:

In [36]:
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [37]:
df = pd.DataFrame({'row': [0, 1, 2],
   ....:                    'One_X': [1.1, 1.1, 1.1],
   ....:                    'One_Y': [1.2, 1.2, 1.2],
   ....:                    'Two_X': [1.11, 1.11, 1.11],
   ....:                    'Two_Y': [1.22, 1.22, 1.22]})
   ....:

In [38]:
df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [39]:
df.set_index('row')

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22